{
    "regularText": "Women in Governance, Risk, Compliance, Financial Crime, and Fraud Prevention is a pioneering initiative founded by Dr. Foluso Amusa, PhD, dedicated to empowering women professionals in these critical fields. Our mission is to foster leadership, inspire innovation, and create a collaborative platform for women to thrive, lead, and make a lasting impact across industries. We believe in the power of diversity and inclusion to drive ethical practices, enhance profession...",
    "vision": "A world where the integrity of the financial sector is strengthened by the equal representation and expert leadership of women in GRC",
    "purpose": "To create a supportive platform that champions the advancement of women in GRC, financial crime, and fraud prevention by fostering leadership, professional growth, and collaboration across industries and sectors.",
    "missionStatements": [
      "Promoting Leadership: Providing mentorship, training, and networking opportunities to prepare women for leadership roles.",
      "Advancing Expertise: Offering access to cutting-edge knowledge, resources, and best practices in governance, compliance, and fraud prevention.",
      "Fostering Inclusion: Advocating for diversity and equity in all sectors, driving systemic change to create a more balanced workforce.",
      "Upholding Integrity: Encouraging ethical practices and professional excellence to combat financial crime and build trust in organizations.",
      "Driving Collaboration: Connecting professionals across industries to share insights, develop solutions, and shape the future of GRC and financial crime prevention."
    ],
    "whatWeDo": [
      {
        "title": "Empower Leaders",
        "text": "We provide mentorship, training, and resources to equip women with the skills and confidence to lead in their organizations.",
        "img": "/images/about/about-what6.png"
      },
      {
        "title": "Foster Collaboration",
        "text": "Through events, networking opportunities, and partnerships, we connect professionals to exchange insights, share best practices, and solve real-world challenges.",
        "img": "/images/about/about-what5.png"
      },
      {
        "title": "Drive Innovation",
        "text": "We stay at the forefront of industry trends, offering tools and knowledge to navigate the rapidly evolving GRC and financial crime landscape.",
        "img": "/images/about/about-what4.png"
      },
      {
        "title": "Global Events & Summits",
        "text": "We organise international conferences, workshops, webinars, and forums that bring together regulators, professionals, and innovators to exchange knowledge, network, and set future directions.",
        "img": "/images/about/about-what3.png"
      },
      {
        "title": "Promote Integrity",
        "text": "Upholding the highest ethical standards, we champion practices that build trust and drive sustainable change across industries.",
        "img": "/images/about/about-what2.png"
      },
      {
        "title": "Advocate for Equity",
        "text": "We work to break down barriers and ensure that women have equal opportunities to excel in their careers.",
        "img": "/images/about/about-what1.png"
      }
    ]
  }