{
    "board": [
      {
        "name": "KAI ORGA",
        "title": "Senior Member, Chartered Institute of Bankers of Nigeria",
        "info": "<h5>Senior Member, Chartered Institute of Bankers of Nigeria (HCIB)</h5>\n\n<p>She holds a MSc in Management and Information Systems from the Institute for Development Policy and Management (IDPM), UK</p>\n\n<p>She holds a BSC degree in International Studies from Ahmadu Bello University, Zaria.</p>\n\n<p>She is a Chartered IABFM (International Academy of Business & Financial Management) Wealth Management Professional, an Associate Member of Talent Development, Associate Member Nigerian Institute of Management (AMNIM) and a Certified Neurolinguistics Coach.</p>\n\n<p>She is also an Honorary Senior Member, Chartered Institute of Bankers of Nigeria (HCIB) Fellow, The Institute of Business Development, Nigeria (FBDI).</p>\n\n<p>She has also trained on subjects such as Entrepreneurship, Human Resource Management, Personal effectiveness, Staff Motivation, Leadership, Customer Relations, Marketing, Administration, Teamwork, Business Career Development, and Sales Management.</p>\n\n<p>She has worked for over 23 years in the financial services sector as a Banker, financial planner and Wealth Advisor</p>",
        "image": "/images/recognition/kai.png"
      },
      {
        "name": "SHLOMIT WAGMAN",
        "title": "Former Director General of Isreal's Money Laundering and Terror...",
        "info": "<h5>Former Director General of Isreal's Money Laundering and Terrorism Financing Prohibition Authority</h5>\n\n<p>Dr. Shlomit Wagman was the Director-General of the Israel Money Laundering and Terror Financing Prohibition Authority (IMPA), a financial regulator and law enforcement agency, from 2016 to 2022, and the Acting Director-General of the Israel Privacy Protection Authority from 2019 to 2021. She was the Head of the Israeli delegation to the Financial Action Task Force (FATF), the global Money Laundering and Terrorism Financing watchdog from 2016 to 2022, and also served as a Co-Chair of its operational working group, a member of the Steering Group, and was a nominee for Presidency.</p>\n\n<p>She led major national reforms, most recently regulating cryptocurrencies, and the historic accession of Israel to the FATF as a member country, after an evaluation process in which Israel was placed among the top three most effective countries in the world.</p>",
        "image": "/images/recognition/shlomit.png"
      },
      {
        "name": "IFE FASHOLA",
        "title": "Group Chief Executive Officer, Kedari Capital Limited",
        "info": "<h5>Group Chief Executive Officer, Kedari Capital Limited</h5>\n\n<p>Experienced Director with a demonstrated history of working in the financial services industry Skilled in Investment Banking, Trading, Law, Technology, Management, and Strategy.</p>\n\n<p>She is a member of UNOPS Advisory Group on Investments (AGI) UNOPS committee Investments for on Sustainable Investments in Infrastructure and Innovation (S31) initiative Ife is the Group Chief Executive Officer of Kedari Capital Limited</p>",
        "image": "/images/recognition/ife.png"
      },
      {
        "name": "HADIZA ADUKONU",
        "title": "Vice President, Corporate Development for West Titan Energy.",
        "info": "<h5>Vice President, Corporate Development for West Titan Energy</h5>\n\n<p>Hadiza holds a BSc. Economics from Ahmadu Bello University, Zaria and an MSc. Oil and Gas Enterprise Management from University of Aberdeen, Scotland She is an Associate Chartered Accountant (ACA), Institute of Chartered Accountants of Nigeria (ICAN).</p>\n\n<p>She is a member of the Reporting Council of Nigeria (FRC) Financial. She is a member of the Society of Petroleum Engineers (SPE). She is an Associate of Women in Management and Business and Public Service (WIMBIZ)</p>\n\n<p>She is also a Project Management Professional (PMP) and PRINCE2 Foundation certified. Hadiza is an oil and gas industry professional with a career spanning over 13 years in the commercial field.</p>\n\n<p>She has expertise in incubating, managing and implementing complex projects as well as strategies for business growth and development.</p>\n\n<p>HadizaAdukonu is the Vice President, Corporate Development for West Titan Energy.</p>",
        "image": "/images/recognition/hadiza.png"
      },
      {
        "name": "AMAKA NSOFOR",
        "title": "Leading Debt Capital Markets Professional in Africa",
        "info": "<h5>Leading Debt Capital Markets Professional in Africa & Founder of Female Scholars Foundation</h5>\n\n<p>Amaka is one of the leading debt capital markets professionals in Africa with global experience spanning Africa, Central and Eastern Europe and Middle East Amaka recently announced that they priced a 5 year USD 500m senior unsecured Eurobond transaction for Access Bank Nigeria at a yield of 6.125%</p>\n\n<p>She is also the Founder of Female Scholars Foundation, a non-for profit organisation set up to provide tertiary education, guidance and mentorship to young women in the rural areas, in order to adequately equip them to integrate into the modern society and obtain reputable professional jobs across the globe.</p>\n\n<p>She holds a Bachelor's degree in Accounting and Finance She earned qualifications as a chartered accountant and took the Chartered Financial Analyst (CFA) exams.</p>\n\n<p>She also obtained a dual MBA from Columbia Business School and London Business School. Amaka is currently the Executive Director of Debt Capital Markets at Standard Chartered Bank She was part of the committee set up by the Securities and Exchange Commission (\"SEC\") to review the SEC rules and regulations, which evolved into the new consolidated rule book used today in the market.</p>",
        "image": "/images/recognition/amaka.png"
      },
      {
        "name": "CECILIA AKINTOMIDE",
        "title": "Senior Executive Adviser to the Group CEO of Ecobank Transnational",
        "info": "<h5>Senior Executive Adviser to the Group CEO of Ecobank Transnational</h5>\n\n<p>Cecilia holds a Bachelor of Laws degree from the University of Ife (now OAU); Master of Laws from the University of Miami Law School; Master of Laws from the University of Pennsylvania Law School; and an Executive MBA from TRIUM (a combined program by LSE, NYU and HEC</p>\n\n<p>She was also admitted to the Nigerian Bar and the New York State Bar.</p>\n\n<p>She has served in senior roles including Vice President Secretary General of the African Development Bank (AfDB) of which she provided leadership for the dynamic relationship between the AfDB and its then 80 member states, and served as Secretary to the 80-member Ministerial Boards of Governors and 20- member resident Boards of Directors</p>\n\n<p>She is the Senior Executive Adviser to the Group CEO of Ecobank Transnational Incorporated, in Lome, Togo, Africa's Pan African Bank operating in 33 African countries</p>",
        "image": "/images/recognition/cecilia.png"
      },
      {
        "name": "ILZE ZNOTIŅA",
        "title": "Member of the Mangement Board, Augstsprieguma tikls AS",
        "info": "<h5>Member of the Mangement Board, Augstsprieguma tikls AS</h5>\n\n<p>With over 25 years of experience in the legal and financial sectors, She is a management board member at Augstsprieguma tīkls AS (AST AS), the Latvian transmission system operator. She oversees the company's legal, compliance, and support functions. She is also a lecturer at the University of Latvia, teaching courses on security risks and crisis management.</p>\n\n<p>Her core competencies include dispute resolution, commercial litigation, corporate law, and financial crime prevention. She has a strong track record of leading and transforming organizations, initiating and managing innovative projects, and collaborating with diverse stakeholders. She is a certified anti-money laundering specialist (CAMS) and a chair of the Global Coalition to Fight Financial Crime's Europe Chapter. She has published and spoken extensively on topics such as fraud, money laundering, corruption, and sanctions. She has emphasized the importance of intelligence and a sustainable AML regime to address evolving digital threats.</p>",
        "image": "/images/recognition/ilze.png"
      },
      {
        "name": "FUNKE FEYISETAN LADIMEJI",
        "title": "Executive Director, Coronation Merchant...",
        "info": "<h5>Executive Director at Coronation Merchant Bank</h5>\n\n<p>Funke holds a Master's degree in Globalisation and a Bachelor's degree in Economics from Queen Mary and Brunel Universities respectively. Funke is a Fellow of the Institute of Chartered Accountants of England & Wales. She was once the Executive Director and Chief Operating Officer at FBN Quest Merchant Bank Group Funke is a transformational business leader in banking and financial services with nearly 30 years' experiences international</p>\n\n<p>She has 14 years with global responsibilities in managing businesses at JP Morgan Chase in London She also has eight years leading the development of an African investment bank. She has a detailed knowledge of global markets and investment banking products She is presently the Executive Director at Coronation Merchant Bank</p>",
        "image": "/images/recognition/funke.png"
      },
      {
        "name": "RALUCA PRUNA",
        "title": "Head of Unit at the European Commission's DG FISMA",
        "info": "<h5>Head of Unit at the European Commission's DG FISMA</h5>\n\n<p>Raluca Prună works for the European Commission, as Head of Financial Crime Unit in DG Financial Stability, Financial Services and Capital Markets Union (FISMA). From 2015 to 2017, she served as Minister of Justice in the Romanian Government. Since 2007, she worked in several Directorate Generals of the European Commission, in various fields as fight against organized crime, financial crime, and free movement of goods. Previously she worked in the Legal Service of the Council of the European Union (2005-2007) and the Delegation of the European Commission in Bucharest (2000-2005). Ms Prună started her career as lawyer in 1996. She is a founding member and former President of Transparency International Romania.</p>\n\n<p>She is leading the EU's efforts to establish the AML Authority, which aims to strengthen compliance across Europe.</p>",
        "image": "/images/recognition/raluca.png"
      },
      {
        "name": "DOROTHY JEFF NNAMANI",
        "title": "MD/CEO of Novo Health Africa Ltd.",
        "info": "<h5>MD/CEO of Novo Health Africa Ltd.</h5>\n\n<p>Dorothy has technical and administrative expertise in managing large and complex health programmes spanning over 20 years with an in-depth knowledge of the Nigerian health sector acquired through research, programming, and managerial experience. She was the former MD/CEO PHB Healthcare limited, a subsidiary of Bank PHB (HMO).</p>\n\n<p>She holds a M.B.B.S in Medicine and Surgery from the University of Nsuka, Nigeria, MPH degree from the College of Medicine, University of Lagos, Nigeria, and an M.Sc. in Infectious Diseases, London, UK Dorothy is the MD/CEO of Novo Health Africa Ltd. Her health care (Novo Health Africa Ltd), is accredited by the National Health Insurance Scheme (NHIS)</p>",
        "image": "/images/recognition/dorothy.png"
      },
      {
        "name": "MOMOEMI IBISIKI (PHD)",
        "title": "Company Secretary/Legal Adviser, Heritage Bank Plc",
        "info": "<h5>Company Secretary/Legal Adviser, Heritage Bank Plc</h5>\n\n<p>Imomoemi is a member of the Nigerian Bar Association (Lagos Branch), and a Fellow of the International Bar Association She is a Member of the Chartered Institute of Arbitrators, United Kingdom (Scotland branch) She is an Associate of the Chartered Institute of Bankers, Nigeria, and a Member of the Chartered Institute of Bankers Scotland, United Kingdom She is a Fellow of the Institute of Credit Administrators, Nigeria.</p>\n\n<p>She holds a research-based doctorate degree (PhD) in Credit and Financial Risk Management, with in-depth research knowledge on the structures and implementation of Credit Guarantee Schemes for Small and Medium Scale Enterprises across Africa She was Divisional Head of the Legal Services Division in Heritage Bank Plc for about 5 years. Imomoemi Ibisiki is the company secretary/legal adviser to the Board of Directors of Heritage Bank Plc.</p>\n\n<p>She holds a research-based doctorate degree (PhD) in Credit and Financial Risk Management</p>",
        "image": "/images/recognition/momoemi.png"
      },
      {
        "name": "RISIKATU LADI AHMED",
        "title": "Experienced Banking Professional & Lawyer",
        "info": "<h5>Experienced Banking Professional & Lawyer</h5>\n\n<p>Risikatu Ladi Ahmed holds a law degree from University of Maiduguri in 1989 and attended Nigerian Law School, Lagos between 1989 and 1990 She was enrolled and called to Nigeria Bar in December 1990 She obtained a Post Graduate Diploma in Management from Abubakar Tafawa Balewa University in 1999 In 2006; she obtained her Master degree in law from University of Jos. Risikatu Ladi Ahmed has over decades of banking experience two decades of banking experience.</p>\n\n<p>She has a track record of excellent performance which has earned several commendations and awards She is a member of Nigerian Bar Association, Chartered Institute of Bankers, Federation of Women Lawyers and Alumni of Lagos Business School Senior Management Programme</p>",
        "image": "/images/recognition/risikatu.png"
      },
      {
        "name": "DR. ADAEZE UDENSI",
        "title": "MD/CEO of Titan Trust Bank Limited",
        "info": "<h5>MD/CEO of Titan Trust Bank Limited</h5>\n\n<p>She is the MD/CEO of Titan Trust Bank Limited Dr. Adaeze was adjudged the 'Female Banker of the Year' at the Business Day Banks and Other Financial Institutions (BAFI) Awards She brings a total of over 23 years of experience and knowledge to the financial services sector Adaeze Udensi holds two MBAs from Rivers State University of Science and Technology and Bangor University in the United Kingdom</p>\n\n<p>She also holds a Bachelor of Science in Banking and Finance from Enugu State University of Science and Technology She also holds a PHD in Credit Management from the University of Panama She pursued continuing education by studying executive management at the Kellogg School of Management, INSEAD, Harvard Business School, and Wharton School of Business. She is a fellow of the Institute of Credit Administration, a member of the Chartered Institute of Bankers, Scotland</p>\n\n<p>She is a member of the Governing Council of The Chartered Institute of Nigeria (CIBN), and an Honorary Senior Member of the Chartered Institute of Bankers of Nigeria. She once served as the Executive Director at Heritage Bank, She spent 16 years at Zenith overseeing the growth of the bank's Oil & Gas, public sector, commercial, and retail activities, propelling it to the second- largest portfolio. She progressed to General Manager before leaving in 2014</p>",
        "image": "/images/recognition/adaeze.png"
      },
      {
        "name": "AMINA SAMBO-MAGAJI (PHD)",
        "title": "AI & Innovation Strategist",
        "info": "<h5>AI & Innovation Strategist</h5>\n\n<p>Dr. Sambo-Magaji has a Masters with PhD (Artificial Intelligence) from the Robert Gordon University, Aberdeen, Scotland. She has also attended Leadership and innovation strategy courses at Harvard University and Massachusetts Institute of Technology. Dr Sambo-Magaji is a United States Distinguished Humphrey Leadership Fellow She is a member Presidential Technology and Creativity Advisory board. She is also member - Nigerian Startup Bill draft She is a core member of MIT REAP (Team Abuja) Dr Sambo-Magaji is a United States Distinguished Leadership Fellow Humphrey - She is a member informal Expert group of the World Telecommunications Policy Forum (IEG-WTPF-21) at ITU, as well as member of the ADHOC Expert Group (AHEG) for the preparation of a draft text of a recommendation on the ethics of artificial intelligence</p>\n\n<p>She is a recipient of several national awards and has published/presented her work in several local and international conferences, seminars and journals. Dr Amina Sambo-Magaji is a computing, academic & policy professional with 20+ years successful business transformation for private and public sector organizations For four years, Dr Sambo-Magaji was in charge of coordinating efforts to build the ICT, innovation and entrepreneurship ecosystem in Nigeria as the Head of OIIE (Office for Technology Innovation and Entrepreneurship)</p>",
        "image": "/images/recognition/amina.png"
      },
      {
        "name": "REKHA MODI GOMES",
        "title": "Prudential Chief Operating Officer - Risk Board Qualified, Diversity, Mentor...",
        "info": "<h5>Prudential Chief Operating Officer - Risk Board Qualified, Diversity and Inclusion champion, chair of a Charity, Mentor</h5>\n\n<p>Rekha is an experienced senior leader in Banking Operations, Compliance, Operational Risk and Controls with 30 years in banking. At Prudential she is the COO for Risk. AT HSBC she was the Global Risk Operations Head and was the Chief Control Officer for Wealth and Personal Banking prior to that. She is an Expert in Non-Financial Risk Management, Regulatory Compliance, Financial Crime and Operations. Held senior management roles in Risk and Control, AML, Regulatory Compliance and Operations.</p>\n\n<p>Experienced in transformation and leading change. Experienced in creation and execution of Strategy and creating a culture supporting Risk |Management and Operations management. Built relationships with regulatory authorities and has an understanding of the regulatory environment across geographies. With strong execution skills, Strategised and led significant change to transform and bring in the expected efficiency. She has worked in India, Sweden, London and Hong Kong.</p>",
        "image": "/images/recognition/rekha.png"
      },
      {
        "name": "NANA HEIDER",
        "title": "Head of Financial Crime Intelligence Unit / Business Intelligence Unit bei Deutsche Bank",
        "info": "<h5>Head of Financial Crime Intelligence Unit / Business Intelligence Unit bei Deutsche Bank</h5>\n\n<p>Nana Lisa Heider has a degree in Business Administration with a focus on 'Finance' / 'International Management' in Italy, France, and Germany, She possesses project work and management in the areas of forensic accounting / investigation / prevention as well as compliance / AML / sanctions in the financial sector and industry domestically and internationally, process mapping and analysis, risk and conflict management, and conducting interviews.</p>\n\n<p>She has qualifications in specified fields relevant to project management and compliance within the financial and industrial sectors. The contexts show relevance to international management, finance, and practices project management</p>",
        "image": "/images/recognition/nana.png"
      },
      {
        "name": "ELŻBIETA FRANKÓW-JAŚKIEWICZ",
        "title": "Chair of Egmont Group/Former Chair of MONEYAL",
        "info": "<h5>Chair of Egmont Group/Former Chair of MONEYAL</h5>\n\n<p>Elżbieta Franków-Jaśkiewicz is the Deputy Director of the Department of Financial Information of the Polish Ministry of Finance (Polish FIU - The General Inspector of Financial Information).</p>\n\n<p>She has over 28 years of experience in government administration of Poland - The Polish Police, Ministry of Interior, and Ministry of Finance. For the past 21 years, Mrs. Franków-Jaśkiewicz has focused on anti-money laundering and countering terrorist financing (AML/CFT) issues within the Polish FIU.</p>\n\n<p>Her Egmont Group (EG) undertakings have encompassed participation in the Operational Working Group (OpWG) first before the Information Exchange Working Group (IEWG). For the last few years, Mrs. Franków-Jaśkiewicz has been an active member of the Technical Assistance and Training Working Group (TATWG).</p>\n\n<p>For many years, she has represented the Polish FIU in numerous international AML/CFT activities (EG, FATF, MONEYVAL, EAG, UNODC, OECD, OSCE, the Experts Group on Combating Money Laundering and Terrorism Financing, etc</p>",
        "image": "/images/recognition/elzbieta.png"
      },
      {
        "name": "ENENI ODUWOLE",
        "title": "Chief Executive Officer of Alter-Ed Limited",
        "info": "<h5>Chief Executive Officer of Alter-Ed Limited</h5>\n\n<p>Eneni holds the IBDC.D board director competency designation, is a Chartered Risk Manager (CRM), and is a member of the Institute of Directors Nigeria, is a Chartered Risk Manager (CRM), and is a member of the Institute of Directors Nigeria</p>\n\n<p>Eneni holds the Qualified Risk Director® designation from the DCRO Institute and was the first in Nigeria given permission to use this globally recognized credential She is a member of the Governing Council of the Chartered Risk Management Institute of Nigeria (CRMI) and the Chief Executive Officer of Alter-Ed Limited</p>",
        "image": "/images/recognition/eneni.png"
      },
      {
        "name": "MARY ADERINOLA OJULARI",
        "title": "Deputy Managing Director/ Chief Finance Officer",
        "info": "<h5>Deputy Managing Director/ Chief Finance Officer</h5>\n\n<p>She is a finance executive with over 20 years' experience of which she spent 12 years working in the diaspora She started her career in Audit at KPMG UK, before moving to Bass Group PLC as a management accountant in 2003 and thereafter Whitbread PLC UK as a Management Accountant</p>\n\n<p>Mary holds a degree in Accounting and Finance from London South Bank University She is a fellow member of the Association of Chartered Certified Accountants since 2008 She has several Human Resources certifications from the Lagos Business School Aderinola Mary Ojulari is the Deputy Managing Director/ Chief Finance Officer at Weststar Associates (Weststar)</p>",
        "image": "/images/recognition/mary.png"
      },
      {
        "name": "Dr. TINUOLA AKINBOLAGBE",
        "title": "Mentoring students and young professionals",
        "info": "<h5>Mentoring students and young professionals</h5>\n\n<p>She holds a degree in Medicine & Surgery, graduating from the College of Medicine, University of Lagos She also has a post-graduate Diploma and Master's in Public Health from the London School of Hygiene & Tropical Medicine, University of London Dr. Tinuola Akinbolagbe is the Chief Executive Officer (CEO) at Private Sector Health Alliance of Nigeria (PSHAN) She moved to GlobeMed Healthcare Solutions, as the Medical Director She joined Health Assur Ltd, as the pioneer MD/CEO</p>\n\n<p>She also moved to the health diagnostics sector at Synlab Nigeria where she served as the Chief Executive Officer before joining the PSHAN team. She is actively involved in mentoring students and young professionals and works with several charities and non- profits to raise funds for community health initiatives</p>",
        "image": "/images/recognition/tinuola.png"
      },
      {
        "name": "KARI TUKUR",
        "title": "Vice President of Products, MasterCard, Sub-Saharan Africa",
        "info": "<h5>Vice President of Products, MasterCard, Sub-Saharan Africa</h5>\n\n<p>Kari holds a bachelor's degree in Business Information Systems at Sheffield Hallam University, where she graduated with first-class with honours in 2007. She also holds a master's degree in International Marketing at the University of Birmingham, graduating with distinctions.</p>\n\n<p>She has also boosted her career with various courses in the areas of Marketing, Business and Information Systems Strategy, Database Engineering, Cross- Cultural Communication and more. She is a Simon Evans scholarship awardee and a member of the Chartered Institute of Marketing.</p>\n\n<p>Kari Tukur is the Vice President of products at MasterCard, Sub-Saharan Africa, where she oversees the in-market product strategy across multiple countries within the region Kari was Country Head of Consumer Banking and Privilege (wealth) at the Defunct Diamond Bank PLC in March 2018. In another leadership capacity, she was appointed Head of Personal Banking, Products and Strategy at Stanbic IBTC Bank from 2010 to 2012</p>",
        "image": "/images/recognition/kari.png"
      },
      {
        "name": "NABILA (ISA-ODIDI) AGUELE",
        "title": "Member of the Board of Directors, INSEAD",
        "info": "<h5>Member of the Board of Directors, INSEAD</h5>\n\n<p>Nabila received her BSc. in Human Biology from the University of Toronto. She received her Juris Doctor (JD) from the American University Washington College of Law.</p>\n\n<p>She holds a MBA from INSEAD Nabila was a Special Assistant Attorney General (on secondment) with the District of Columbia Office of the Attorney General.</p>\n\n<p>Her passion for impact-driven-lawyering and leadership development led her to complete a two-year term as Practitioner-in-Residence in the Glushko- Samuelson Intellectual Property Law Clinic and Professor with the Program on Information Justice and Intellectual Property at her alma mater, the American University Washington College of Law.</p>\n\n<p>Nabila previously served as a Special Adviser to the Nigerian Minister of Finance, and as a Technical/Special Adviser to the Nigerian Minister of State for Budget & National Planning.</p>\n\n<p>The Business School for the World, INSEAD, announced Nabila (Isa-Odidi) Aguele, MBA'14J to its Board of Directors, effective 18 June 2021. Nabila is the youngest person appointed to the board, second African and second woman of African descent appointed. She is also the first Nigerian in the history of INSEAD</p>",
        "image": "/images/recognition/nabila.png"
      },
      {
        "name": "FOLA LAOYE",
        "title": "CEO of Health Markets Africa",
        "info": "<h5>CEO of Health Markets Africa</h5>\n\n<p>She holds a Bachelors Degree in Accounting from the University of Lagos, Nigeria and a Masters of Business Administration from Harvard Business School, Cambridge, USA.</p>\n\n<p>In 2011, Fola was nominated as a Young Global Leader by the World Economic Forum and Fola Laoye is Founder and CEO of Health Markets Africa, an advisory investment company.</p>\n\n<p>She was once the Director for West Africa Investments at the Investment Fund for Health in Africa (IFHA)</p>\n\n<p>She is also a board member and was previously CEO and then Chairperson of Hygeia Group Nigeria, promoters of Hygeia HMO and Lagoon Hospitals.</p>\n\n<p>She is a trustee of the Harvard Business School Association of Nigeria (HBSAN) and a member of the Young Presidents Organization (YPO) Lagos Chapter.</p>\n\n<p>Fola has had twenty-eight years of business experience, both locally and internationally, having trained with Ernst & Young, Lagos and Price Water House Coopers in London and is a Member of the Institute of Chartered Accountants in England & Wales and the Institute of Chartered Accountants of Nigeria.</p>",
        "image": "/images/recognition/fola.png"
      }
    ]
  }